Repository: HelaGone/Anlayze_SEO_react_plugin
Catalog: languages/*.po
Languages: es_mx

source: Analyze SEO
es_mx: Análisis de SEO

source: This plugin analyzes SEO in a post
es_mx: Este plugin analiza el SEO en una publicación

source: save changes to update
es_mx: guarda los cambios para actualizar

source: Title Tag
es_mx: Etiqueta Título

source: Title word count:
es_mx: Conteo Título:

source: Meta Description
es_mx: Meta Descripción

source: Description word count:
es_mx: Conteo Descripción:

source: Meta Keywords
es_mx: Meta palabras clave

source: Please don't try to format() a non-string.
es_mx: Por favor no intente format() un no-string.

source: Seo Analysis
es_mx: Análisis SEO

source: Objective Words
es_mx: Palabras Objetivo

source: This should be up to 4 words
es_mx: Esto debe ser hasta 4 palabras

source: It should be between 6 and 12 words long and it hasn't have more than 60 characters
es_mx: Debe ser entre 6 y 12 palabras y no debe tener más de 60 caracteres

source: It should be between 12 and 24 words long
es_mx: Debe ser entre 12 y 24 palabras

source: It should be between 6 and 12 words long
es_mx: Debe ser entre 6 y 12 palabras

source: Word Count & Word Match
es_mx: Conteo Palabras & Coincidencias
